{
  "messages": [
    {
      "from": "爱喝可可的温米安安",
      "location": "Maple Ridge, British Columbia, Canada",
      "country": "Canada",
      "message": "谢谢你给我的生日"
    },
    {
      "from": "Rachel 咚咚",
      "location": "Houston, Texas, United States",
      "country": "United States",
      "message": "真没想到你把7月重要的日子定为生米生日🎁希望你选择巡演的城市当天都听你讲冷笑话，真的不想看到你淋雨"
    },
    {
      "from": "熬一大锅小白粥",
      "location": "New York City, New York, United States",
      "country": "United States",
      "message": "那天的雨很大，我在小舞台第二排的中间，看着你在雨中奔跑，朝我们隔空拥抱，好希望时间定格在那一刻～一起淋过雨的人，真的会一辈子都忘不掉啦！"
    },
    {
      "from": "小咪饭Sunny",
      "location": "Waterloo, Ontario, Canada",
      "country": "Canada",
      "message": "虽然没有抢到票进场内听你唱，但是有幸在场外听了一会儿。当时正好回国实习在武汉，也看到武汉有场周深9.29Hz的演唱会，一想，不去白不去，坐着公交就去体育场了，也是怕后面再也没机会去听现场了。但很荣幸，你来多伦多开演唱会了，享受了一把场内的视听盛宴，真的很感谢你的坚持。下一个十年我们和你一起走！好好爱自己哦！"
    },
    {
      "from": "信望愛米米",
      "location": "Toronto, Ontario, Canada",
      "country": "Canada",
      "message": "2024/7/27深深武漢演唱會，下午去了海底撈 做了應援色的指甲。我們坐地鐵3號線去演唱會場館，還沒出地鐵站，深深已經安排義工在地鐵站發雨衣。下雨，天很熱，進場館後，雨下得更大了，穿著深深送的雨衣，全身上下連鞋子都濕透了。深深卻一直淋著雨歌唱，雨水淋濕了深深，他的頭髮衣服全濕透了。深深說“一起淋過雨的人就永遠不會忘記了”跟深深一起淋雨是多麼幸福和浪漫的事。深深啊，我怎麼可能忘記你呢！！！\n武漢演唱會深深有新的造型，左手臂上貼了 “生米生日快樂”，寶貝給生米唱生日快樂歌，是海底撈版的，說7/25號是生米的生日，祝生米10歲生日快樂，3.5萬人同聲唱祝你生日快樂，場面真的好震撼！！！深深唱「歡顏」時，我彷彿回到了2014年7月25日深深的第一個舞台，當時我好喜歡深深的演唱，感動不已。一轉眼十年過去了，深深歷經無數坎坷艱難走到今天，一步一個腳印走上了更大更廣闊的舞台。想到此我眼裡早已噙滿淚水，心裡是心疼又幸福的感覺。"
    },
    {
      "from": "甜酒釀釀",
      "location": "Houston, Texas, United States",
      "country": "United States",
      "message": "武汉场的《生日祝福歌》，把自己出道十周年当成生米十岁生日过的只有深深了，當海底撈生日祝福歌響起，驚呆了，世上怎麼有這樣好的人。親愛的親愛的生日快樂🎂🎂🎂！每一天都精彩！\n\n從來沒有－個人可以讓我如此仰慕！不愛其他、只愛如此真誠的實在的周深。是的，我用的詞是仰慕！不要再自以為自己是有缺失的、渺小的深深，我從未曾見過另外一個人有如此強大的毅力、自制力和努力。深深出道十週年快樂！有你我在！\n\n點點滴滴聚匯在－起才發覺你說了這麼多鼓勵生米的話，和生米們相互打、氣、加油。－個人能夠被人喜愛絕不是單－方面的，而是多方面能夠共頻投緣。祝深深和生米們十週年快樂！and many many more!🎉🎉🎉🥰🥰🥰💐💐💐🎉🎉😘 @卡布叻_周深"
    },
    {
      "from": "walalilongla💎🦌🩷💙",
      "location": "Houston, Texas, United States",
      "country": "United States",
      "message": "谢谢深深让我在追星旅途中遇到了很好的朋友，上了官摄，一起唱了生日歌，第一次演唱会去看9.29hz好幸福"
    },
    {
      "from": "信望爱",
      "location": "Toronto, Ontario, Canada",
      "country": "Canada",
      "message": "深深宝贝，你说:一起淋过雨就不能忘记了。我有幸和你在武汉淋雨，一起庆祝生日，深信我们彼此永远记得这一天。"
    }
  ]
}